In [1]:
import pandas as pd
import os
import glob

import psycopg2

In [2]:
# Reading sample csv file using pandas
data_departments=pd.read_csv("EmployeeSQL/departments.csv")
data_departments.head()

  dept_no        dept_name
0    d001        Marketing
1    d002          Finance
2    d003  Human Resources
3    d004       Production
4    d005      Development

In [3]:
# Automating reading of all *.csv files contained within the data folder

# Providing folder name and formulate unified *.csv file locator string
folder = "EmployeeSQL"
# Pulling listr of all *.csv files using glob library/f-n
csv_files = glob.glob(os.path.join(folder, "*.csv"))

# Cycling through each file
for f in csv_files:
    # reading the csv file and creating identically named DF
    name = f.split('\\')[1].split('.')[0]
    vars()[name] = pd.read_csv(f)
    # output for debugging
    print("PROCESSING ------------ Reading in " + f + " into " + name + " DF")
    # print(f"                        {vars()[name].columns.to_list()}")

PROCESSING ------------ Reading in EmployeeSQL\departments.csv into departments DF
PROCESSING ------------ Reading in EmployeeSQL\dept_emp.csv into dept_emp DF
PROCESSING ------------ Reading in EmployeeSQL\dept_manager.csv into dept_manager DF
PROCESSING ------------ Reading in EmployeeSQL\employees.csv into employees DF
PROCESSING ------------ Reading in EmployeeSQL\salaries.csv into salaries DF
PROCESSING ------------ Reading in EmployeeSQL\titles.csv into titles DF

In [4]:
# Reviewing departments data
departments

  dept_no           dept_name
0    d001           Marketing
1    d002             Finance
2    d003     Human Resources
3    d004          Production
4    d005         Development
5    d006  Quality Management
6    d007               Sales
7    d008            Research
8    d009    Customer Service

In [5]:
# Reviewing employee data by department
dept_emp

        emp_no dept_no
0        10001    d005
1        10002    d007
2        10003    d004
3        10004    d004
4        10005    d003
...        ...     ...
331598  499995    d004
331599  499996    d004
331600  499997    d005
331601  499998    d002
331602  499999    d004

[331603 rows x 2 columns]

In [6]:
# reviewing manager data by department
dept_manager

   dept_no  emp_no
0     d001  110022
1     d001  110039
2     d002  110085
3     d002  110114
4     d003  110183
5     d003  110228
6     d004  110303
7     d004  110344
8     d004  110386
9     d004  110420
10    d005  110511
11    d005  110567
12    d006  110725
13    d006  110765
14    d006  110800
15    d006  110854
16    d007  111035
17    d007  111133
18    d008  111400
19    d008  111534
20    d009  111692
21    d009  111784
22    d009  111877
23    d009  111939

In [7]:
# Reviewing extensive employee stats data
employees

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date
0,473302,s0001,7/25/1953,Hideyuki,Zallocco,M,4/28/1990
1,475053,e0002,11/18/1954,Byong,Delgrande,F,9/7/1991
2,57444,e0002,1/30/1958,Berry,Babb,F,3/21/1992
3,421786,s0001,9/28/1957,Xiong,Verhoeff,M,11/26/1987
4,282238,e0003,10/28/1952,Abdelkader,Baumann,F,1/18/1991
...,...,...,...,...,...,...,...
300019,464231,s0001,8/14/1958,Constantino,Eastman,M,10/28/1988
300020,255832,e0002,5/8/1955,Yuping,Dayang,F,2/26/1995
300021,76671,s0001,6/9/1959,Ortrud,Plessier,M,2/24/1988
300022,264920,s0001,9/22/1959,Percy,Samarati,F,9/8/1994
300023,464503,s0002,5/31/1964,Arvind,Slobodova,M,11/23/1987

In [8]:
# Reviewing salaries satats
salaries

        emp_no  salary
0        10001   60117
1        10002   65828
2        10003   40006
3        10004   40054
4        10005   78228
...        ...     ...
300019  499995   40000
300020  499996   58058
300021  499997   49597
300022  499998   40000
300023  499999   63707

[300024 rows x 2 columns]

In [9]:
# Reviewing job titles and their corresponding IDs
titles

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer
5    e0004    Technique Leader
6    m0001             Manager

In [ ]:
# ----------------------- SQLAlchemy application -------------------------

In [34]:
# sql database path
from sqlalchemy import create_engine

engine = create_engine('postgresql:postgres//postgres:triger@localhost:5432/sql_hw')
# connection = engine.connect()

ArgumentError: Could not parse rfc1738 URL from string 'postgresql:postgres//postgres:triger@localhost:5432/sql_hw'

In [35]:
from sqlalchemy import create_engine
engine = create_engine(f'postgresql://postgres:postgres@localhost:5432/sql_hw')
conn = engine.connect()

In [37]:
merged_data = pd.read_sql("SELECT * FROM merged_data", conn)

In [38]:
merged_data

,emp_no,emp_title_id,title,birth_date,first_name,last_name,sex,hire_date,dept_no,dept_name,salary
0,10001,e0003,Senior Engineer,1953-09-02,Georgi,Facello,M,1986-06-26,d005,Development,60117
1,10002,s0001,Staff,1964-06-02,Bezalel,Simmel,F,1985-11-21,d007,Sales,65828
2,10003,e0003,Senior Engineer,1959-12-03,Parto,Bamford,M,1986-08-28,d004,Production,40006
3,10004,e0003,Senior Engineer,1954-05-01,Chirstian,Koblick,M,1986-12-01,d004,Production,40054
4,10005,s0001,Staff,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,d003,Human Resources,78228
...,...,...,...,...,...,...,...,...,...,...,...
331598,499995,e0002,Engineer,1958-09-24,Dekang,Lichtner,F,1993-01-12,d004,Production,40000
331599,499996,e0003,Senior Engineer,1953-03-07,Zito,Baaz,M,1990-09-27,d004,Production,58058
331600,499997,e0003,Senior Engineer,1961-08-03,Berhard,Lenart,M,1986-04-21,d005,Development,49597
331601,499998,s0001,Staff,1956-09-05,Patricia,Breugel,M,1993-10-13,d002,Finance,40000
331602,499999,e0002,Engineer,1958-05-01,Sachin,Tsukuda,M,1997-11-30,d004,Production,63707